//_______________________ Задание 1 _______________________

let i = 0;

while (i < 2) {

    console.log("Привет!");
    i++;
}


//_______________________ Задание 2 _______________________

let a = 1;

while (a <= 5) {
    console.log(a);
    a++;
}


//_______________________ Задание 3 _______________________

let b = 7;

while (b <= 22) {
    console.log(b);
    b++;
}


//_______________________ Задание 4 _______________________

let obj = {
   Коля: '200',
   Вася: '300',
   Петя: '400'
}

for (let key in obj) {
   console.log(`${key} — зарплата ${obj[key]} долларов.`);
}


//_______________________ Задание 5 _______________________

let n = 1000;
let num = 0;
let result = n;

while (result >= 50) {
    result /= 2;
    num++; 
}

console.log(`${result} - результат деления, который меньше 50;  ${num} - количество итераций.`);


//_______________________ Задание 6 _______________________

for (let numFriday = 6; numFriday <= 31; numFriday +=7) {

    console.log(`Сегодня пятница, ${numFriday}-е число. Необходимо подготовить отчет.`);
}

