//_______________________ Задание 1 _______________________

let password = 'пароль';
let whichPassword = prompt('Введите пароль');

if (whichPassword === password) {
     console.log('Пароль введен верно');

} else {
    console.log('Пароль введен неправильно');
}


//_______________________ Задание 2 _______________________

let c = 2;

if (c > 0 && c < 10) {
     console.log('Верно');

} else {
    console.log('Неверно');
}


//_______________________ Задание 3 _______________________

let d = 20;
let e = 180;

if (d > 100 || e > 100) {
     console.log('Верно');

} else {
    console.log('Неверно');
}


